In [1]:
import numpy as np
import pandas as pd

In [2]:
dictionary={"A":[1,2,np.nan],"B":[5,np.nan,np.nan],"C":[1,2,3]}

In [3]:
df=pd.DataFrame(dictionary)

In [4]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [5]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [6]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [7]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [8]:
df.fillna(value="CHƯA NHẬP")

           A          B  C
0        1.0        5.0  1
1        2.0  CHƯA NHẬP  2
2  CHƯA NHẬP  CHƯA NHẬP  3

In [9]:
df.fillna(value=df["A"].sum())

     A    B  C
0  1.0  5.0  1
1  2.0  3.0  2
2  3.0  3.0  3